<template>
  <view class="text-container p-20">
    <view class="title">安装服务协议</view>
    <view class="section-title bold em-2">
      本协议具有合同效力，在发布订单前，您当仔细阅读本协议内容，当您勾选“同意”并发布订单时，即表示您已充分阅读本协议内容、理解并接受本协议条款的全部内容，则本协议立即生效。
    </view>
    <view>
      为保证本平台和用户的权利和义务，依据实际情况，订立以下安装服务协议：
    </view>
    <view class="section-title"> 一、服务内容 </view>
    <view>
      1.按照用户所提供产品的设备安装、调试以及其他指定的安装服务要求，由平台协调符合要求的合作接单方完成安装服务；
    </view>
    <view>
      2.平台按照用户提供的技术人员要求安装或按照双方认同的技术要求进行安装服务；
    </view>
    <view> 3.向用方提供平台的使用权限； </view>
    <view class="section-title"> 二、权利和义务 </view>
    <view class="bold"> 2.1.下单方的权利和义务： </view>
    <view> 2.1.1下单方需要提供安装图或者安装说明书，配合安装门店的安装； </view>
    <view> 2.1.2下单方有义务确保提供的产品设备符合质量标准； </view>
    <view>
      2.1.3如产品安装需特定的配件、特殊工具等，下单方有义务提前在备注栏写清楚，未提前告知导致安装不上的问题，由下单方承担责任；
    </view>
    <view>
      2.1.4如因自身产品属性问题导致安装不上、安装售后、车辆损坏等问题，由下单方承担责任；
    </view>
    <view>
      2.1.5如因产品与车型不符，导致安装不上的问题，由下单方承担责任；
    </view>
    <view class="bold"> 2.2平台的权利和义务： </view>
    <view>
      2.2.1平台有义务协调处理下单方和接单方在产品设备安装中产生的问题；
    </view>
    <view>
      2.2.2平台应保证接单方均为合格专业技师，有相关产品的安装经验，保证接单方良好的服务态度；
    </view>
    <view>
      2.2.3完成安装后三个月内，因安装产品导致的车辆问题，平台要求接单方提供最多五次检查售后服务(如检查结果是安装技术导致问题产生的，接单方负责处理售后，如是产品自身属性导致车辆出现问题，需下单方自行承担）。安装质保期为自安装开始日期顺延3个月为安装质保期。
    </view>
    <view>
      2.2.4如安装过程中因接单方原因造成的车辆配件损坏，将由平台组织各方协商处理；
    </view>
    <view>
      2.2.5如下单方或车主与接单方协商退安装服务定单走线下交易，即视为下单方未在平台派安装服务定单，平台免责。
    </view>
    <view class="section-title"> 三、免责条款 </view>
    <view>
      1.本平台是一个安装服务的公司，是为下单方和接单方打通连接的关系，鉴于产品的属性，平台不清楚是否会给车辆带来损坏；线下安装中无法确定因什么原因导致车辆配件的损坏，本平台只承担协调责任；
    </view>
    <view>
      2.当出现纠纷情况时，平台协助各方来解决赔偿问题，如未能协助各方解决问题的同时，平台最多拿出1-3倍的安装费用作为此次的补偿。
    </view>
    <view class="section-title"> 四、补偿细则 </view>
    <view>
      1．接单方已接单但未开始安装，下单方申请取消订单，平台退回本次订单全部安装费；
    </view>
    <view class="em-2"> 2．接单方已接单并已开始安装： </view>
    <view class="em-2">
      ①如因平台和接单方原因导致无法完成安装，退回本次订单安装费的100%至下单方账号；
    </view>
    <view class="em-2">
      ②如已开始施工但未完工，因下单方和车主原因（如车主突然不想安装了/产品错发、缺件等原因）导致无法完成安装，退回本次订单安装费的50%至下单方账号；
    </view>
    <view class="em-2">
      3.已完成安装，如是下单方或车主原因要求拆卸，或产品原因导致无法正常使用，不退安装费;
    </view>
    <view class="em-2">
      4．因接单方存在推销自家产品原因导致车主退货，经平台查证情况属实，退回本次订单全部安装费并补偿本次订单安装费的100%至下单方。
    </view>
    <view class="em-2"> 5．产品与安装类目不符（下错订单类型）： </view>
    <view class="em-2">
      ①接单方已接单但未开始安装，退回本次订单全部安装费用，并协助下单方选择正确类目进行再次下单；
    </view>
    <view class="em-2">
      ②接单方已开始安装，如果实际类目价格高于本次订单选择类目价格，由下单方支付相应差价，如甲方不补齐差价金额，本次订单安装费用不退，并对本次安装服务不提供售后及补偿；
    </view>
    <view class="em-2">
      ②接单方已开始安装，如果实际类目价格低于本次订单选择类目价格，由平台退价差至下单方的账号；
    </view>
    <view class="em-2"> 6．因产品与安装车辆不匹配： </view>
    <view class="em-2">
      ①接单方已接单但未开始安装，平台退回本次全部安装费用至下单方账号；
    </view>
    <view class="em-2">
      ②接单方已接单并已开始安装，不退回本次安装费用，并对本次安装服务不提供售后及补偿。
    </view>
    <view class="em-2">
      7.如产品已在其他接单方安装过一次或多次，但无法完成安装，平台对此类安装服务订单进行退单处理，退回此次全部安装费用。如下单方未提前告知平台订单的实际情况，但平台核实此次安装服务订单是此类订单，不退回本次安装费用，并对本次安装服务不提供售后及补偿。因此带来的一切损失由下单方负责。如因产品属性问题（例如：安装部分产品会出现原车线束无法恢复、钥匙损坏等问题），导致产品无法安装完成，平台不退回本次安装费用，并对本次安装服务不提供售后及补偿。因此带来的一切损失由下单方负责。
    </view>
    <view class="em-2"> 8.车辆损坏补偿标准： </view>
    <view class="em-2">
      如因安装过程中导致车辆有损坏，原则上安装导致的问题门店负责修复和赔偿，产品问题导致车辆损坏商家负责修复赔偿，平台协调各方解决赔偿，在无法解决问题情况下，乙方作出以下补偿：
    </view>
    <view class="em-2">
      1.因产品原因、下单方原因、车主原因导致的损坏，平台不作补偿；
    </view>
    <view class="em-2">
      2.因接单方原因导致的损坏，平台支付此次损失的100%作为补偿，赔偿总金额最高为本次订单安装费的三倍。
    </view>
    <view class="section-title"> 五、售后服务 </view>
    <view>
      1.产品安装完成后，开始实施安装服务保障，接单方安装质保期自安装开始日期顺延90天，期间内下单方可享受安装售后服务。因产品安装导致的车辆问题，平台要求接单方提供最多3次检查售后服务。
    </view>
    <view> 2.以下情况不能享受安装服务保障： </view>
    <view class="em-2">
      ①不能提供安装订单编号、下单方联系号码或车主联系号码任意一项；
    </view>
    <view class="em-2">
      ②用户对产品使用不当，擅自拆卸或私自找过其他维修等原因导致的损坏；
    </view>
    <view class="em-2">
      ③因自然灾害造成的损坏，如火灾、地震、洪水、房屋塌陷等；
    </view>
    <view class="em-2"> ④产品安装已超出有效的安装质保期。 </view>
  </view>
</template>

<script lang="ts" setup></script>

<style lang="scss" scoped>
.text-container {
  font-size: 28rpx;
}
.title {
  margin-bottom: 20rpx;
  font-size: 30rpx;
  text-align: center;
}
.bold {
  font-weight: bold;
}
.em-2 {
  text-indent: 2em;
}
.section-title {
  font-size: 28rpx;
  margin: 10rpx 0;
  font-weight: bold;
}
.content {
  line-height: 28rpx;
}
</style>
